/*
  Localizable.strings
  Patched Sur

  Portuguese (pt-PT)
  Created by BrunoRochadj on 5/2/21.
*/

// MARK: Pre-Install App (96)
// Generic

"GET-STARTED" = "Iniciar";
"CONTINUE" = "Continuar";
"GO-BACK" = "Para trás";
"CANCEL" = "Cancelar";
"BROWSE" = "Navegar";
"REFRESH" = "Refrescar";
"CONTINUE-ERASE" = "Continuar e Apagar";
"REQUEST-ROOT" = "Pedir Permissões de Root";
"EXTRACT-PACKAGE" = "Extrair Pacote";
"FINISHED" = "Finalizado";

// Enter Password Prompt
"B-ENTER-PASS-CHANGES" = "Patched Sur Gostaria de fazer modificações.";
"B-ENTER-PASS-ALLOW" = "Inserir Palavra Passe para permitir.";
// The main difference here is
"B-EP-USERNAME" = "Nome de Utilizador:";
// The only difference here is the colon, which sounds dumb, but it's needed.
"B-EP-PASSWORD" = "Palavra Passe:";
"B-EP-PASSWORD-PH" = "Palavra Passe";

// Welcome Page

// Reminder! "Patched Sur" is a formal name, so don't localize that. (Patches/Patcher can be localized, just not Patched Sur)
"PRE-WELCOME-TITLE" = "Bem-Vindo ao Patched Sur!";
"PRE-WELCOME-DESCRIPTION" = "Este patcher foi feito para lhe oferecer uma atualização mais simples do macOS Big Sur para o seu Mac sem compatibilidade. Prepara tudo para ficar perfeito no final da instalação. Por fim,
tentará fazer com que o seu Mac funcione como se se fosse compatível.";

// Thanks To Page

"THANKS-TITLE" = "Agradecimentos";
"THANKS-CONTENT" = "Patched Sur não foi criado apenas por mim (Ben), Várias pessoas contribuíram para o patcher e para a criação dos patches como são hoje!

- barrykn: Criou o micropatcher que me apresentou ao processo de patching e restaurou a minha fé no meu computador realmente antigo. Tiro o meu chapéu ao Barrykn, e devia fazer o mesmo.
- ASentientBot: Criou os patches Hax para o instalador e adicionou o framebuffer GeForce Tesla (9400M / 320M) ao Big Sur em conjunto com os patches de aceleração de gráficas não-metálicas.
- jackluke: Descobriu como contornar as verificações de compatibilidade no USB do instalador.
- highvoltage12v: Criou os primeiros kexts de WiFi usados no Big Sur
- ParrotGeek: Desenvolveu o kext LegacyUSBInjector para fazer as portas USB funcionarem em alguns Macs mais antigos e descobriu uma forma de ultrapassar os comandos do terminal ao abrir o instalador no USB.
- testheit: Ajudou com o comando kmutil no micropatcher (que também é usado no Patched Sur).
- Ausdauersportler: Integrou patches para iMac com compatibilidade para Metal GPU.
- StarPlayrX: Avisou sobre o startosinstall que posteriormente foi usado no patcher para permitir o suporte à atualização do macOS sem USB.
- ASentientHedgehog: Ajudou várias vezes durante o processo.
- OCLP Team: Ajudou com assuntos ao nível de kernel para placas não-Tesla e para aceleração de gráficos de placas não-metálicas.
- dosdude1: Troca OpenGL / GPUSupport e, claro, muitas das coisas usadas no seu patcher.
- Bweesh, Bruno Rocha, DutchDK, NickP0is0n, 8itCat, Finder352, DJT_233, Noah Fetz, duke4e, riiveraluis pela tradução desta aplicação.
- John_val, fromeister2009, Mr. Macintosh, Emperor Epitaph, Finder352, Monkiey and 8itCat por testarem algumas das novas funções antes do lançamento, e por apontarem os erros nas mesmas.
- e vários outros que ajudaram a fazer o Big Sur funcionar tão bem em Macs sem compatibilidade.

Patched Sur também usa dois frameworks de código aberto (Open Source), Files e ShellOut de JohnSundell (Licença do MIT), para ajudar a lidar com certas tarefas.";

// Please Remember Page

"PLEASE-REMEMBER" = "Não Esquecer";
"PRE-PR-1" = "O Patched Sur está atualmente em beta e nunca será perfeito. Embora não avarie o seu Mac, pode fazer com que você perca os seus dados se não tiver um backup.";
"PRE-PR-2" = " Seja como for, faça sempre um Backup no Time Machine antes de atualizar. ";
"PRE-PR-3" = "Eu (e os colaboradores) não somos responsáveis ​ algo que possa correr mal. Farei o melhor que puder para ajudar se houver algum problema, mas não sei tudo e há alguns casos em que não posso mesmo ajudar. Muitas das vezes, a culpa nem sequer é do Patched Sur, e nesse caso não há nada que eu possa fazer.";

// Mac Compatibility Page

"PRE-VERIFY-MAC" = "A verificar o Mac";
"PRE-VERIFY-QUICK" = "Este primeiro passo é essencial para a confiabilidade do Patched Sur. Esta etapa tenta detectar o máximo possível de problemas causados ​​antes de acontecerem. Isto inclui o FileVault, falha na aceleração de gráficos e alguns outros problemas. Não se preocupe, isso será rápido.";
"PRE-VERIFY-FETCH" = "A reunir informações";
"PRE-VERIFY-2" = "A verificar o Mac";

"PRE-REPORT-BY" = "Reportado por: ";
"PERSON" = "pessoa";
"OTHERS" = "outros";
"APPROVES" = "aprovou";
"APPROVE" = "aprovar";

"WiFi, Ethernet and Bluetooth" = "WiFi, Ethernet e Bluetooth";
"I/O Ports" = "Portas I/O";
"Graphics Acceleration" = "Aceleração de Gráficos";
"Sleep and Brightness" = "Pausa e Brilho";
"FileVault" = "FileVault";
"Personal Hotspots" = "Hotspots Pessoais";
"Personal Hotspot" = "Hotspot Pessoal";
"WPA2 Enterprise" = "WPA2 Enterprise";

"PROB-FATAL" = "Problema Fatal Detectado";
"PROB-WARN" = "Possível Problema Detectado";
"PROB-NO-UPGRADE" = "Não é possível atualizar para Big Sur por causa deste ou de outros problemas.";
"PROB-CONTINUE-ANYWAY" = "Continuar mesmo assim";
"PROB-OTHERS" = "Outros Problemas";

"PROB-FILE-TITLE" = "FileVault está Ativo.";
"PROB-FILE-DESCRIPTION" = "O seu Mac está com o FileVault ativo. Embora seja uma boa ferramenta de criptografia, ela não funciona no Big Sur em Macs incompatíveis. Você não conseguirá iniciar em modo de recuperação e, às vezes, poderá não conseguir desbloquear o disco. Você deve desativa-lo antes de executar o patcher. Você pode fazer isso indo a Preferências do Sistema, clicar em Segurança e Privacidade, vá a FileVault, clique no ícone de cadeado e desative-o.";

// Reminder! "BigMac" and "StarPlayrX" are a formal names, so don't localize that.
"PROB-PRO-TITLE" = "Existe um  Patcher melhor for Mac Pros";
"PROB-PRO-DESCRIPTION" = "Embora o Patched Sur seja ótimo para muitos Macs, os Mac Pros realmente não devem ser usados ​​com este patcher. Eles não têm os patches adequados e há outro patcher fácil de usar projectado especificamente para Mac Pros. É o BigMac Patcher da StarPlayrX e proporcionará uma experiência incrível para o seu Mac.";

"PROB-GX-TITLE" = "Sem Aceleração Gráfica";
"PROB-GX-DESCRIPTION" = "Seu Mac não suporta aceleração gráfica de Metal, então, o Big Sur funcionará EXTREMAMENTE LENTO. Não espere que seja rápido e não espere que funcione bem. Você não pode corrigir isto e um patch está em andamento para corrigir isso, mas o seu estado atual é extremamente instável. Se quiser continuar, você pode, mas não espere uma experiência mágica ou completa do Big Sur.";

"PROB-SURE" = "Tem a certeza que quer continuar?";
"PROB-SURE-SURE" = "O Patched Sur detectou problemas que podem (e irão) causar problemas com Big Sur. O seu Mac pode não estar em todo o seu potencial e, em alguns casos, pode ser bom ficar apenas pelo Catalina.";

"REPORT-UNKNOWN" = "Compatibilidade Desconhecida";
"REPORT-UNKNOWN-2" = "Dependendo do seu Mac, o Patched Sur pode ou não funcionar bem, e o Patched Sur não encontrou nenhum relatório de compatibilidade para o seu Mac, portanto, de momento não há essa informação . Não se preocupe, muitas pessoas não deram informações sobre como o Patched Sur funciona em todos os diferentes Macs, então seu Mac provavelmente funcionará perfeitamente bem. Depois de atualizar, você pode contribuir com a sua experiência (vá a Configurações na aplicação pós-instalação) e ajude outras pessoas com seu Mac!";

// Update Track Page

"PRE-TRACK-TITLE" = "Definir tipo de atualização";
"PRE-TRACK-DESCRIPTION" = "O tipo de atualização define que versão do macOS é obtida. A atualização de lançamento é a mais estável e provavelmente a que você já está a usar. Beta dá acesso a novos recursos do macOS mais cedo, mas às vezes é instável.";

"TRACK-RELEASE" = "Lançamento";
"TRACK-BETA" = "Beta";

// macOS Select Page

"PRE-VERS-TITLE" = "Versão do macOS Big Sur";
"PRE-VERS-DESCRIPTION" = "Embora na maioria dos casos você deseje a versão mais recente do macOS Big Sur, por qualquer motivo você pode querer uma versão mais antiga e pode configurá-la aqui. Se quiser usar um InstallAssistant.pkg pré-descarregado ou uma aplicação de instalação, clique em navegar. Se você deseja apenas fazer a descarga e usar a versão mais recente do macOS, basta clicar em Descarregar.";
"PRE-VERS-NOFI" = "Não há acesso á lista de instaladores disponíveis do macOS . Provavelmente, o WiFi está indisponível. Você tem de usar um instalador do macOS pré-descarregado.";
// NOTE: In these two, XX.YY.ZZ is the macOS version. So in English, the first would show Download macOS 11.3. \(installers[0].version)
"PRE-VERS-DOWNLOAD" = "Descarregar o macOS XX.YY.ZZ";
"PRE-VERS-USE" = "Usar o macOS XX.YY.ZZ";
"PRE-VERS-PRE" = "Usar o macOS Pre-Descarregado";
"PRE-VERS-REDOWNLOAD" = "Voltar a Descarregar";
"PRE-VERS-FETCH" = "A procurar instaladores";

// Downloading Kexts Page

"DOWNLOAD-PATCHES" = "A Descarregar Patches";
"DOWNLOAD-FILES" = "A Descarregar Ficheiros";
"PRE-DP-1" = "A ferramenta set vars permite que  configure corretamente o status NVRAM e SIP, para que o Big Sur permita que você inicie nele.";
"PRE-DP-2" = "Esta é a última ferramenta que você usará antes de instalar o Big Sur.";
"PRE-DP-3" = "Você só precisará disto se não o tiver executado antes no Mac ou se tiver feito uma reposição de PRAM.";
"PRE-DP-4" = "Os patch kexts permitem que você use hardware como WiFi e portas USB, para que seu Mac permaneça com todas as suas funcionalidades.";
"PRE-DP-CANCEL-1" = "Os patches que serão usados ​​posteriormente pelo patcher estão a ser descarregados neste momento. Tem certeza que quer voltar?";
"PRE-DP-CANCEL-2" = "Os Patches estão a ser Descarregados";
"CANCEL-DOWNLOAD" = "Cancelar a Descarga";
"RESTART-DOWNLOAD" = "Reiniciar a Descarga";
"CONTINUE-DOWNLOAD" = "Continuar a Descarga";
"PRE-DP-CANCEL-3" = "A descarga dos patches falhou, no entanto isso pode ser resolvido tentando novamente. Deseja tentar descarregar os patches novamente ou ir para o passo anterior?";
"PRE-DP-CANCEL-4" = "Deseja reiniciar a descarga?";

// Downloading macOS Page

"PRE-DM-TITLE" = "A Descarregar o macOS";
"PRE-DM-DESCRIPTION" = "Atualmente, o macOS está a ser descarregado diretamente da Apple para que possa ser colocado no instalador USB. Este é um instalador completo, portanto, é uma descarga de 12 GB. Isto vai demorar um pouco, então deixe andar e certifique-se de que sua conexão com a internet está boa. Depois de fazer isso, você terá de selecionar uma unidade USB para o instalador e então o Patched Sur usará este ficheiro para construir o instalador USB.";
"PRE-DM-BAR" = "A Descarregar o macOS XX.YY.ZZ";
"PRE-DM-CANCEL-1" = "O macOS Big Sur está a ser descarregado para uso posterior. Esta é uma descarga grande. Tem certeza que quer voltar?";
"PRE-DM-CANCEL-2" = "macOS está a ser Descarregado";
"PRE-DM-CANCEL-3" = "A descarga do macOS falhou, mas isso pode ser resolvido tentando novamente. Você gostaria de voltar a tentar fazer a descarga do macOS ou ir para o passo anterior?";

// Select Volume Page

"PRE-VOL-TITLE" = "Selecionar Uma Unidade USB";
"PRE-VOL-1" = "Para instalar o patched Big Sur inicialmente, você precisa de um instalador USB que ajudará na atualização. Isso fornece um ambiente onde o patcher pode ter certeza de que tudo funcionará corretamente.";
"PRE-VOL-2" = "Para criar um instalador, você precisa de uma unidade USB para colocar o instalador.";
"PRE-VOL-3" = "Esta unidade USB deve ter 16 GB ou mais. As partições internas não funcionarão, mas as partições externas sim, dependendo do mapa de partição (que provavelmente estará correto como Mapa de Partição GUID). Se a sua unidade não aparecer, certifique-se de que ela esteja formatada como MacOS Expandido (Com Journaling).";
"PRE-VOL-NO" = "Não foram encontradas unidades compatíveis.";
// Note: VOLUME is the volume name, do not localize it, just pretend it's a volume name and just place it into your sentence
// Ex. If the volume was "SuperDrive", then "VOLUME will be erased." would show up as "SuperDrive will be erased."
"PRE-VOL-ERASED" = "VOLUME vai ser apagado.";
"PRE-VOL-ERASED-2" = "Todos os ficheiros nesta unidade vão ser completamente apagados. Isto não pode ser desfeito. Tem certeza de que quer de continuar?";
"PRE-VOL-DETECTING" = "A Detectar Unidades";
"PRE-VOL-CHECKING" = "A Verificar VOLUME";

// Create Installer Page

"PRE-CTI-TITLE" = "A Criar Instalador USB";
"PRE-CTI-DESCRIPTION" = "Agora, o USB que você selecionou está a ser usado para criar um instalador USB do macOS. Os arquivos copiados para o disco criam um ambiente semelhante ao Modo de Recuperação do macOS Big Sur. Uma vez que esses arquivos são colocados no USB, o Patched Sur avança faz o patch, permitindo que o seu Mac inicie nele fornecendo algumas ferramentas úteis para um patched Mac.";
"PRE-CTI-CANCEL-1" = "Tem certeza de que deseja cancelar a criação do instalador do patched macOS? Você vai precisar disto para atualizar para o macOS Big Sur, e ás vezes demora muito tempo para criar.";
"PRE-CTI-CANCEL-2" = "Um Instalador do macOS Está a Ser Criado";
"CANCEL-PROCESS" = "Cancelar o Processo";
"RESTART-PROCESS" = "Reiniciar o Processo";
"CONTINUE-PROCESS" = "Continuar o Processo";
"PRE-CTI-CANCEL-3" = "Ocorreu um erro ao criar o instalador USB do macOS, mas você pode tentar novamente para corrigir esse erro.";
"PRE-CTI-CANCEL-4" = "Quer tentar novamente?";
"PRE-CTI-CREATING" = "A Criar o Instalador";

// Done Page
"PRE-DONE-INFO" = "A atualização para o Big Sur está quase pronta. O instalador USB foi criado com sucesso e está na  hora de você fazer um pequeno trabalho manual. Se você não estiver seguindo um tutorial diretamente, anote estes passos para que saiba como fazê-los (esses passos são bastante fáceis, embora pareça que são muitos):

1. Reinicie o seu Mac mantendo pressionada a tecla opção até que alguma unidade apareça no monitor
2. Selecione a unidade  EFI Boot amarela ou roxa. Isso desligará imediatamente o seu computador.
3. Volte a ligar o Mac, de novo mantendo pressionada a tecla opção,
4. Selecione Instalar macOS Big Sur.
5. Assim que o Mac iniciar, selecione de novo (Re)Instalar o macOS Big Sur. (Pode parecer, mas isso não vai apagar os dados do utilizador, apenas vai atualizar os arquivos do sistema como uma atualização normal).
6. Quando essa aplicação abrir, selecione o volume principal (provavelmente Macintosh HD e NÃO Install macOS Big Sur).
7. Depois de atualização estar concluída e a janela de login aparecer, abra a pasta Aplicações e inicie o Patched Sur.
8. Clique em Patch Kexts, Clique Continuar e escreva a sua palavra-passe.
9. Depois de concluído , reinicie o seu Mac e aproveite Big Sur!";
// I suggest adding "However, these are only in English." to the end of this, since the linked page is only in English.
"PRE-DONE-LINK" = "Estes passos também podem ser encontrados no GitHub.\nNo entanto, estão apenas em inglês.";
"PRE-DONE-STEPS" = "(Passos 10-14)";

// MARK: Post-Install App (96)

// General

"BACK" = "Para Trás";
"RESTART-TO-FINISH" = "Reiniciar para Terminar";

// MARK: Menu Bar

"PO-MN-ABOUT-PATCHER" = "Acerca do Patched Sur";
"PREFERENCES" = "Preferências";
"PO-AMM-TITLE" = "Acerca deste Mac";
"PO-MN-HELP" = "Ajuda do Patched Sur";
"PO-MN-HELP-OS" = "Atualização do macOS";
"PO-MN-HELP-PATCHER" = "Atualização do patcher";

// MARK: Update Notifications

// VERSIONTAG is the version number of the new patcher/macOS version (like 0.3.1 or 11.3.1).
"PO-NOFI-SELF" = "O Patched Sur pode agora ser atualizado para a versão VERSIONTAG. Abre o Patched Sur e clica em Executar Atualizações para saber mais.";
"PO-NOFI-OS-TITLE" = "Atualização do Software";
"PO-NOFI-OS-DESCRIPTION" = "O macOS Big Sur VERSIONTAG pode agora ser instalado no teu dispositivo. Abre o Patched Sur e clica em Atualizar o macOS para saber mais.";

// MARK: About Patched Sur

// APPBUILD is the app's version build number, like "96".
"PO-ATP-AUTHOR-BUILD" = "Por: Ben Sova • Build APPBUILD";
"PO-ATP-DESCRIPTION" = "Um patcher simples, com um grande coração, para facilitar a execução do Big Sur em Macs sem suporte, projectado para ser utilizado por qualquer pessoa.";
"PO-ATP-WHATS-NEW-QUESTION" = "Novidades da v1.0.0?";
"PO-ATP-WHATS-NEW-ANSWER" = "É rápido, poderoso, simples para todos, mesmo que a gráfica seja non-Metal ou mesmo que não fale Inglês.";

// MARK: Central View

"PO-UP-TITLE" = "Correr Atualizações";
"PO-UP-DESCRIPTION" = "Atualiza o macOS ou o patcher para uma versão mais recente para te manteres atualizado.";
"PO-PK-TITLE" = "Patch Kexts";
"PO-PK-DESCRIPTION" = "Os Kexts fornecem ao macOS todas as funcionalidades para que tudo funcione correctamente.";
"PO-ST-TITLE" = "Preferências";
"PO-ST-DESCRIPTION" = "Desativar animações, ativar troca automática entre placas gráficas, mostrar logs e talvez até mais.";
"PO-CI-TITLE" = "Criar Instalador";
"PO-CI-DESCRIPTION" = "Crie uma unidade USB do instalador do macOS Big Sur com o patch para que possa (re) instalar o macOS e muito mais.";
"PO-IR-TITLE" = "Instalar Modo de Recuperação";
"PO-IR-DESCRIPTION" = "Faz o patch do volume de recuperação atual (usado com CMD-R durante o arranque). Nem sempre é útil.";
"PO-AMM-DESCRIPTION" = "Mostra informações sobre o teu mac sem o número de série. Bom para te gabares do teu sucesso.";

"PO-PK-NO-NEED-TITLE" = "O Patch dos Kexts Não é necessário";
"PO-PK-NO-NEED-DESCRIPTION" = "Não precisas de fazer o patch dos kexts nos iMacs de final de 2013. O Big Sur já está a correr com todas as funcionalidades.";

// MARK: Settings View

"PO-ST-TITLE-ALT" = "Preferências Extra";
"PO-ST-SUBTITLE" = "Algumas Ferramentas/Patches úteis";
"PO-ST-SECTION-1" = "Patches Extra";
"PO-ST-SECTION-2" = "Ferramentas Extra";
"PO-ST-RESTART-APPLY" = "Assim que o Mac reiniciar, as mudanças serão aplicadas";

"PO-ST-DA-DISABLE" = "Desactivar Animações";
"ENABLE" = "Activar";
"PO-ST-DA-DISABLE-DONE" = "Desactivar Animações!";
"PO-ST-DA-DISABLE-DONE-2" = "Assim que o Mac reiniciar, as mudanças serão aplicadas, e o Big Sur deverá ter um desempenho ligeiramente melhor.";
"PO-ST-DA-ENABLE-DONE" = "Activar Animações!";
"PO-ST-DA-DESCRIPTION" = "Desativar animações pode ajudar os Macs non-Metal. Como não têm aceleração gráfica, o Big Sur corre extremamente lento, então desactivar as animações vai ajudar.";

"PO-ST-GXS-ENABLE" = "Activar Troca de Gráficas";
"DISABLE" = "Desactivar";
"PO-ST-GXS-DESCRIPTION" = "Se tens um Mac com várias GPUs, provavelmente desejas activar a troca automática de gráficas. Obrigado a @15wat por encontrar esta solução.";
"PO-ST-GXS-ENABLE-DONE" = "Troca de Gráficas Activa";
"PO-ST-GXS-ENABLE-DONE-2" = "Agora a troca de gráficas será automática! Pode ser necessário reiniciar para que as alterações tenham efeito.";
"PO-ST-GXS-ENABLE-FAILED" = "Falha ao Activar Troca de Gráficas";
"PO-ST-GXS-DISABLE-DONE" = "Troca de Gráficas Inactiva";
"PO-ST-GXS-DISABLE-DONE-2" = "Agora a troca de gráficas não será automática! Pode ser necessário reiniciar para que as alterações tenham efeito.";
"PO-ST-GXS-ENABLE-FAILED" = "Falha ao Desactivar Troca de Gráficas";

"PO-ST-PKL-BUTTON" = "Mostrar Logs do Patch dos Kexts";
"PO-ST-PKL-DESCRIPTION" = "Se está a ter problemas com o patch dos Kexts não funcionar, pode valer a pena ver os logs e procurar erros. Isso pode ajudar alguém que está a tentar ajudar a descobrir o problema; portanto, se puder, forneça isso a qualquer pessoa que esteja a tentar ajudá-lo.";
"PO-ST-PKL-TITLE" = "Logs do Patch dos Kexts";
"PO-ST-PKL-NO-LOGS" = "Não foram gravados Logs";
"PO-ST-PKL-COPIED" = "Copiado!";
"PO-ST-PKL-COPIED-2" = "Os últimos logs do Patch dos Kexts foram copiados para a sua área de transferência. Isso pode ajudar na depuração, certifique-se de partilhar isto com qualquer pessoa que tente ajudá-lo com seu problema.";

"PO-ST-CL-TITLE" = "Limpar as sobras de instalação do Patched Sur";
"PO-ST-CL-DESCRIPTION" = "Às vezes, o Patched Sur, acidentalmente deixa pequenas sobras de quando algo foi executado. Isso às vezes pode economizar 12 GB de espaço de armazenamento, sugiro ser feito principalmente depois de executar a atualização.";
"PO-ST-CL-DONE" = "Limpar Sobras";
"PO-ST-CL-DONE-2" = "Os ficheiros foram apagados, agora deve ter um pouco mais de espaço livre (assumindo que realmente havia arquivos grandes a serem apagados).";

"PO-ST-CYE-TITLE" = "Contribuir com a Tua Experiência";
// Add a translation for 'Please Note: These reports are only accepted in English.' to this next value
"PO-ST-CYE-DESCRIPTION" = "A aplicação pré-instalação no Patched Sur tem um recurso que permite aos novos utilizadores saber como seu Mac funcionará com o Big Sur. No entanto, algo assim precisa de informações e é nisso que podes ajudar! Basta clicar no link acima e seguir as instruções para ajudar.
Nota: apenas são aceites submissões em Inglês";

"PO-ST-RL-TITLE" = "Re-Abrir o Patcher";
"PO-ST-RL-DESCRIPTION" = "Não sei porque quererás isto, mas acho que se quiseres, podes reiniciar a aplicação do patcher. Isso irá atualizar muitas das variáveis ​​que são obtidas quando o patcher é iniciado pela primeira vez. Curiosidade: este é o mesmo código executado quando a atualização for concluída.";
"PO-ST-RL-FAILED" = "Falha da Re-Abertura!";
"PO-ST-RL-FAILED-2" = "Falha ao abrir o Patched Sur, mas podes fazer isso sozinho.";

// MARK: Patch Kexts Page

"PO-PK-TITLE-ALT" = "Unpatch Kexts";
"PO-PK-SUBTITLE" = "Basicamente fazer os Drivers Funcionarem";
"PO-PK-DESCRIPTION-2" = "Fazer o Patch dos kexts faz com que o Wifi, USB e várias outras coisas funcionem na instalação do Big Sur. Sem estes kexts o Big Sur não vai estar no seu pleno potencial e varias coisas não vão funcionar. Se for necessário podes fazer Un-Patch dos kexts e, depois, voltar a fazer o Patch, o que pode resolver algum problema. Às vezes, pode ser uma boa ideia esperar um pouco antes de executar o patch dos kexts, já que algumas coisas podem estar a interferir no volume do sistema.";
"PO-PK-START" = "Iniciar o Patch dos Kexts";
"PO-PK-UN-START" = "Iniciar Un-patch dos Kexts";
"PO-PK-INSTEAD" = "Un-patch dos Kexts";
"PO-PK-INSTEAD-REVERSE" = "Patch dos Kexts";
"PO-PK-DETECT" = "Detecting Patches";
"PO-PK-NONE-DETECTED" = "Não foram detectados os recursos do Patch";
"PO-PK-NONE-HELP" = "Tenta inserir o USB do Patched Installer";
"PO-PK-RUNNING" = "Patching Kexts";
"PO-PK-UN-RUNNING" = "Un-patching Kexts";
"PO-PK-LEGACY-ALERT" = "Os únicos  Patches Detectados Requerem o Modo Legacy";

// MARK: Create Installer Others

"PO-CI-START-TITLE" = "Criar o  Instalador macOS";
"PO-CI-START-DESCRIPTION" = "Esta ferramenta permite que seja criado um instalador USB do macOS Big Sur com o patch do Patched Sur, semelhante à forma como a aplicação de pré-instalação faz, exceto com algumas alterações. Isto pode definitivamente ser usado no caso de ter um problema mais tarde com o patcher. Nota,  podes instalar uma partição de recuperação bastante semelhante a esta; no entanto, atualmente não é possível reinstalar o macOS, pois não há WiFi na recuperação, mas com este instalador podes. Nota também que, se estiveres a usar isto para atualizar, existe uma maneira mais fácil, que é a aplicação pós-instalação.";
"PO-CI-FINISHED-TITLE" = "A Criação do Instalador do macOS foi Finalizada";
"PO-CI-FINSIHED-DESCRIPTION" = "Este instalador agora pode ser usado para qualquer finalidade que queiras. É totalmente patched como seria se o fizesses com a aplicação de pré-instalação. Ele contém o instalador do macOS (provavelmente sabes disso), um ambiente completo de modo de recuperação e, claro, o Patched Sur para fazer o patch dos kexts.";

// MARK: About This Mac

"PO-AMM-MODEL" = "Modelo";
"PO-AMM-PROCESSOR" = "Processador";
"PO-AMM-GRAPHICS" = "Placa Gráfica";
"PO-AMM-MEMORY" = "Memória";
"PO-AMM-BACK" = "Voltar ao Início";
"PO-AMM-UPDATE" = "Atualização de Software";
"PO-AMM-VERSION" = "Versão";

// MARK: Update Status

"PO-UP-CHECKING" = "Procurar Atualizações";
"PO-UP-CHECK-FAILED" = "Falha ao Procurar Atualizações";
"PO-UP-CHECK-FAILED-1" = "Isto provavelmente significa que a conexão WiFi está inativa ou os servidores de hospedagem na web do GitHub estão inativos. Isto não deve ser um problema, assumindo que possas atualizar o macOS manualmente com a aplicação de pré-instalação ou atualizar a própria aplicação do patcher descarregada da página Patched Sur do GitHub.";
"PO-UP-TITLE-PATCHER" = "Atualizar o Patcher";
"PO-UP-TITLE-MACOS" = "Atualizar o macOS";

"PO-UP-USING-TRACK" = "Está a utilizar";
// Imagine that this is like a sentence. First you see the above phrase, then Release or Beta, then the next text.
// So this would read, "You are using the Release update track"
"PO-UP-USING-TRACK-2" = ".";
"PO-UP-BETA-DESCRIPTION" = "Essas atualizações podem ser instáveis ​​e nem sempre são o melhor para o uso diário.";
"PO-UP-RELEASE-DESCRIPTION" = "Estas atualizações são normalmente mais estáveis ​​e é atualização padrão por predefinição.";
"PO-UP-IS-AVALIBLE" = "Atualização Disponível!";
"RELEASED" = "Lançada";
"BUILD" = "Build";
"PO-UP-VIEW-OTHER" = "Ver Outras Versões";
"PO-UP-START-TITLE" = "Iniciar a Atualização do macOS";
"PO-UP-START-DESCRIPTION" = "Para atualizar, o patcher primeiro vai descarregar os patches mais recentes e, de seguida, a nova versão do macOS diretamente da Apple e, depois disso, o atualizador da Apple será iniciado sem a verificação de compatibilidade.";
"PO-UP-NOTES-TITLE" = "Ver as Ultimas Notas de Lançamento";
"PO-UP-NOTES-DESCRIPTION" = "Veja o que há de novo no macOS antes de atualizar. Obrigado ao Mr. Macintosh (ou às vezes Apple / 9to5Mac) por fornecer isto.";
"PO-UP-NO-UPDATES" = "Não existem novas atualizações disponíveis.";
"PO-UP-YOU-ON" = "Estás a usar XX.YY.ZZ.";
"PO-UP-NOTIF-TITLE" = "Configurar Notificações de Atualizações";
"PO-UP-NOTIF-DESCRIPTION" = "Receber notificações de atualizações para macOS e patcher.";

"PO-UP-NOTIF-TITLE-2" = "Atualizar Notificações";
// In case you don't know, /n means line down. So if I wrote Hello\nWorld, it would show up as:
// Hello
// World
"PO-UP-NOTIF-DESCRIPTION-2" = "Como o seu Mac não é compatível, a Atualização de software nunca o informará sobre as atualizações do macOS, porque não há nada novo que ofereça suporte ao seu Mac. No entanto, o Patched Sur pode fornecer essa funcionalidade, fornecendo também notificações de atualizações para o patcher, se desejar. \ n \ nReceber notificações para:";
"NO" = "Não";
"YES" = "Sim";
"CONFIRM" = "Confirmar";
"PO-NOTIF-SETUP-DONE" = "Configurar Notificações!";
"PO-NOTIF-SETUP-DONE-2" = "Patched Sur irá notificá-lo corretamente sobre as atualizações com base em suas novas preferências";
"PO-NOTIF-SETUP-PERMS" = "O Patched Sur necessita de permissões para enviar notificações.";
"PO-NOTIF-SETUP-PERMS-2" = "Antes que o patcher possa enviar notificações de atualizações disponíveis, ele precisa de permissão para enviar as notificações.";
"PO-NOTIF-SETUP-ALMOST" = "Quase pronto!";
"PO-NOTIF-SETUP-ALMOST-2" = "Para terminar de configurar as notificações, o Patched Sur requer a criação de um daemon de utilizador que irá verificar de vez em quando. Para configurar isto, o patcher precisa ter acesso root, então, será solicitado que insira a palavra-pass, depois disso está pronto!";
"PO-NOTIF-SETUP-DENY" = "O Patched Sur não consegue enviar Notificações";
"PO-NOTIF-SETUP-DENY-2" = "Deve ter negado ao Patched Sur o envio de notificações. Se quiseres que o Patched Sur envie notificações, abre Preferências do Sistema> Notificações> Patched Sur e permite as notificações.";
"PO-NOTIF-SETUP-FAILED" = "Falha ao configurar o Daemon";

"PO-UP-COMPAT-FAIL-SIP" = "Falha ao verificar o Estado do SIP";
"PO-UP-COMPAT-FAIL-SIP-2" = "O Patched Sur não conseguiu verificar o estado do SIP, o que deveria ser impossível";
"PO-UP-COMPAT-SIP-ON" = "O SIP Parece estar Ligado";
"PO-UP-COMPAT-SIP-ON-2" = "Como o instalador verifica se a atualização é compatível com o seu Mac, o Patched Sur precisa injetar uma dylib para que o instalador não se preocupe com a incompatibilidade. No entanto, isso só pode ser feito com o SIP desativado, então o Patched Sur precisa que desatives o SIP antes de continuar. Para desativa-lo:

1. Arranca em modo de recuperação (⌘R no arranque)
2. Abre o Terminal em Utilitários.
3. Digita: csrutil disable e pressione enter.
4. Pressione Enter e reinicia o computador, depois tenta executar o Patched Sur novamente.";
"PO-UP-COMPAT-LV-ON" = "A Validação de Biblioteca está Activa";
"PO-UP-COMPAT-LV-ON-2" = "A Validação de Biblioteca impede que o Patched Sur injecte código no instalador do macOS e ignore a verificação de compatibilidade. Se quiser atualizar o macOS, primeiro desative a Validação de Biblioteca.";

"SKIP" = "Saltar";
"PO-UP-APP-FAILED" = "A Descarga Falhou";
"PO-UP-APP-START" = "Atualizar a Descarga";
"DOWNLOADING" = "A Descarregar";

// MARK: Update Chooser

"PO-UP-CHOOSE-TITLE" = "Escolher Atualização";
"PO-UP-CHOOSE-FAILED" = "Ocorreu um erro ao procurar as atualizações disponíveis.";
"PO-UP-CHOOSE-PRE" = "Esta versão do macOS já foi descarregada:";
"PO-UP-CHOOSE-CAN" = "Podes descarregar as seguintes versões do macOS:";
"PO-UP-CHOOSE-DELETE" = "Tem certeza de que deseja apagar o instalador pré-descarregado?";
"PO-UP-CHOOSE-DELETE-2" = "Embora isto vá economizar 12,2 GBs de armazenamento, também é útil para reinstalar rapidamente o macOS ou para qualquer outro motivo pelo qual possas precisar de um instalador do macOS de 12 GB.";
"DELETE" = "Apagar";
"UPDATE" = "Atualizar";
"REINSTALL" = "Reinstalar";
"UNEXPECTED-ERROR" = "Ocorreu Um Erro Inesperado";
"PO-UP-CHOOSE-EXACT-PATH" = "Este ficheiro parece estar em falta e o patch completo não pode ser determinado. Não podes usar o instalador pré-descarregado por enquanto.";
"PO-UP-CHOOSE-DOWNLOAD" = "Descarregar o Instalador do macOS";
"PO-UP-CHOOSE-DOWNLOAD-1" = "Podes atualizar para esta versão do macOS, mas também pode descarrega-la e esse foi o botão em que clicaste. Este pop-up existe apenas para garantir que sabias isso. (Isso apenas abrirá o teu navegador da web e fará a descarga do instalador, nada de especial.)";
"PO-UP-CHOOSE-DOWNLOAD-2" = "Não podes \"atualizar\" para uma versão mais antiga do macOS, no entanto, podes descarregar o instalador se quiseres fazer algo com ele. (Isso apenas abrirá o teu navegador da web e fará a descarga do instalador, nada de especial.)";
"PO-UP-CHOOSE-DOWNLOAD-TIP" = "Se quiseres também podes descarregar o InstallAssistant.pkg.";
"PO-UP-CHOOSE-DOWNLOAD-TIP-2" = "Não podes atualizar para uma versão mais antiga do macOS, no entanto, podes descarregar o instalador se quiseres";
"DOWNLOAD" = "Descarga";

// MARK: Download Patches/macOS

"DOWNLOAD-PATCH-MACOS" = "Downloading Patches and macOS";
"DOWNLOADED-PATCHES" = "Downloaded Patches";
"PO-UP-DPM-DESCRIPTION" = "Os patches permitem que uses hardware como WiFi e permite que o patcher substitua o código do instalador, para que o teu Mac permaneça  com sua total funcionalidade. O macOS está a ser descarregado diretamente da Apple, na forma de um ficheiro InstallAssistant.pkg . Com isto, podemos extrair a aplicação do instalador e iniciar a instalação do macOS. (Às vezes, a barra de progresso quebra, mas não tem problema, o ficheiro está a ser descarregado.)";
"DOWNLOADING-MACOS" = "A Descarregar o macOS";

// MARK: Starting OS Installer

"PO-UP-SOI-TITLE" = "Pronto para Atualizar!";
"PO-UP-SOI-DESCRIPTION" = "Agora, o Patched Sur vai terminar de se preparar para a atualização e reiniciar no macOS Updater. Depois de um tempo, a instalação do macOS terminará e poderes fazer o patch dos kexts e aproveitar o macOS. Isso vai demorar um bocado! Assim como na preparação para a atualização nas preferências do sistema, isso não é a coisa mais rápida do mundo.";
"PO-UP-SOI-PREPARING" = "A Preparar para Atualizar";

// MARK: Recovery Patch

"PO-IR-SUBTITLE" = "Algo Meio Util";
"DISCLAMIER" = "AVISO LEGAL";
"PO-IR-DISCLAIM" = "Isto NÃO É algo em que se deva confiar a 100%. Isto é maioritariamente apenas um \ “pega, é o melhor vais ter por agora. \" Eu tentei fazer um modo de recuperação de sonho, mas não funcionou, principalmente porque o firmware no teu Mac ignora ficheiros sem razão alguma. Se esses ficheiros não fossem ignorados, eu não teria que escrever esta mensagem. No entanto, podes fazer o seguinte com a recuperação: Gerir valores de NVRAM (como o estado do SIP e os argumentos de arranque), usar o Utilitário de disco, navegar na web (acho eu?) E fazer o un-patch/patch dos kexts (e provavelmente mais algumas coisas).
A minha sugestão é criar um instalador usb e guarda-lo.
Não podes reinstalar o macOS com ele.";
"PO-IR-SIP-ON" = "O SIP está Ligado";
"PO-IR-SIP-ON-DESCRIPTION" = "O patch de recuperação não pode ser instalado com o SIP ativado por causa das proteções do sistema de ficheiros. Pode parecer que a única maneira de desligar o SIP é com o modo de recuperação, mas existem outras formas. \ n \ nSe ainda tiveres o USB do instalador, poderás conseguir arrancar no EFI de arranque. Se isso não funcionar ou não conseguires fazer isso, arranca em  modo de recuperação de internet (CMD-OPTION-R no arranque) e partir daí já consegues.";
"PO-IR-PATCHING" = "A fazer o Patch da Recuperação";
"PO-IR-PATCHING-DESCRIPTION" = "O modo de recuperação do macOS está agora a ser corrigido no teu Mac. Este processo tem duas etapas: a primeira é fazer a descarga dos ficheiros necessários e a segunda é instalá-los. É super simples e não demora muito. Feito isso, a recuperação do macOS será desbloqueada. Nota que se tiveres várias partições, a recuperação do disco de arranque será (provavelmente) preferida e será feito por aí o arranque em vez de uma das outras recuperações instaladas.";
"PO-IR-DOWNLOAD-RECOVERY" = "A Descarregar a Recuperação";
"PO-IR-DONE" = "Patch da Recuperação Terminado!";
"GO-HOME" = "Voltar ao Inicio";

// MARK: Three v1.0.0 (102)

// Friends in SettingsYes I'm adding this lol - duke4e advertised Patched Sur so I have to get him back and then I decided to add macOSicons.com because I like them. Maybe I'll have more friends later.
"PO-ST-FRIENDS" = "Amigos do Patched Sur";
"PO-ST-FRIENDS-WIDGY" = "Widgy é uma app incrível para fazer widgets 100% personalizados para iOS e macOS! Com ela, podes cobrir o teu iDevice com todos os dados que desejares, organizados como desejares, e ao mesmo tempo combinar perfeitamente com o resto da tua Página Inicial / Ambiente de Trabalho. Muito bom, certo?";
"PO-ST-FRIENDS-ICONS" = "macOSicons.com é um site com mais de 5.000 ícones alternativos para o macOS Big Sur. Aqui podes obter ícones para substituir ícones que não sejam do estilo Big Sur ou apenas porque gostas mais dos designs de lá do que do desenvolvedor do design da app.";

// MARK: Patch Kexts Configuration

"PO-PK-CONFIGURE" = "Configuração Avançada";
"PO-PK-CONFIG-WARN" = "AVISO: As configurações avançadas só devem ser utilizadas se realmente souberes o que estás a fazer!
Certifica-te que não activas patches desnecessários.";
// This will come right before a button that toggles between "Patch Kexts" and "Unpatch Kexts"
"PO-PK-CONFIG-MODE" = "Modo:";
"PO-PK-CONFIG-UNPATCH" = "Todos os patches dos Kexts serão desinstalados e o sistema será restaurado para o seu antigo estado sem patch. O WiFi não vai funcionar e possivelmente outras coisas, isto não pode ser configurado. Isto pode destruir as coleções de kernel do sistema, resultando num pânico de kernel do Mac ou na incapacidade de refazer o patch dos kexts, geralmente é mais seguro apenas reinstalar o macOS em vez de fazer o unpatch.";
"ENABLED" = "Activado";
"DISABLED" = "Desactivado";

// MARK: Boot.plist Settings

"PO-ST-BOOT" = "Patch Boot.plist";
"PO-ST-BOOT-DONE" = "A Boot.plist já tem Patch";
"PO-ST-BOOT-DESCRIPTION" = "Fazer o patch da com.apple.Boot.plist permite repor a  NVRAM no teu Mac sem precisar do instalador USB nem de iniciar na EFI. Depois disso, terás de restaurar a NVRAM (O Patched Sur vai ajudar), pois é melhor ter esse valor do que não o ter. Terás de repetir o patch da plist sempre que atualizares o macOS.";
"PO-ST-BOOT-ONGOING" = "A fazer o patch da Boot.plist";
"PO-ST-BOOT-NONE" = "Não foram detectados patches compatíveis.
Podes não ter descarregado a versão mais recente dos patches, necessários para corrigir o boot.plist.
Usa 'Atualizar backup de patches ' para atualizar os patches e tenta novamente.";

// MARK: Volume Selection

"PRE-VOL-INCOMPAT" = "Ver Drives Incompativéis";
"PRE-VOL-INCOMPAT-TITLE" = "Drives Incompativéis";
"PRE-VOL-INCOMPAT-NODATA" = "Informação do disco não encontrada, isto pode ser um bug do patcher";
"PRE-VOL-INCOMPAT-INTERNAL" = "Disco interno, escolhe um disco USB externo.";
"PRE-VOL-INCOMPAT-IMAGE" = "As imagens de disco não foram carregadas, escolhe um disco USB externo.";
// For these next two, I suggest checking Disk Utility for the proper terms for GUID Partition Map and MacOS Extended (Journaled).
"PRE-VOL-INCOMPAT-GUID" = "Não está formatado com Mapa de Partição GUID";
"PRE-VOL-INCOMPAT-SYNTH" = "Volume em Sistema de ficheiros da Apple (APFS), usa MacOS Expandido (com journaling)";

// MARK: NVRAM Reset Wanring

"PO-NV-POPUP-TITLE" = "Valor de NVRAM requerido em falta";
"PO-NV-POPUP-DESCRIPTION" = "O valor de -no_compat_check boot-arg está em falta
Embora o Patched Sur já te tenha protegido do maior problema causado por isto, ainda existem outros problemas que podem resultar do valor em falta.";
"PO-NV-POPUP-START" = "Ver Instruções";
"PO-NV-POPUP-DESCRIPTION-TWO" = "Iniciar o Patched Sur (a aplicação de pós-instalação, não a do dmg) para saber mais e soluções para restaurar o valor.";
"PO-NV-POPUP-DESCRIPTION-THREE" = "Pressiona Ver Instruções  para saber como restaurár.";
"PO-NV-CHECK-TITLE" = "Tens o Teu Patched Installer USB?";
"PO-NV-CHECK-DESCRIPTION" = "Se ainda tens o USB do instalador com patch, podemos saltar várias complexidades e tornar isso muito fácil. É altamente recomendável guardar sempre um instalador USB da versão mais recente do macOS, então, se quiseres fazer um agora, clica no botão Voltar no canto superior direito, clica em Criar instalador e segue as instruções para criar um e voltar aqui.";
"PO-NV-CHECK-ONE" = "Eu tenho o USB Patched Installer.";
"PO-NV-CHECK-TWO" = "Não tenho.";
"PO-NV-ONE-TITLE" = "Restaurar Valores (com instalador)";
"PO-NV-ONE-CONTENT" = "Uma vez que tens o instalador USB, isto será super simples e indolor!\n1. Desliga o teu Mac, volta a ligá-lo e segura a tecla option.\n2. Certifica-te de que o instalador USB está inserido, selecciona a unidade de arranque EFI púrpura.\n3. O Mac irá desligar-se imediatamente como esperado, agora basta ligá-lo novamente e está pronto!";
"PO-NV-TWO-TITLE" = "Restaurar Valores (sem o instalador)";
"PO-NV-TWO-CONTENT" = "Uma vez que não tens o instalador USB, isto será um pouco mais difícil, mas não te preocupes, ainda assim será fácil. Se quiseres, podes escrever isto uma vez que o Patched Sur não te poderá ajudar durante o caminho.\n1. Desliga o teu Mac, volta a ligá-lo mantendo o CMD-OPTION-R (mesmo que tenha instalado a recuperação, ainda precisa de recuperação na Internet para isto).\n2. Ligua-te ao WiFi, depois deixa-o arrancar.\n3. Clique Utilitários na barra de menu e depois em Terminal.\n4. Digita 'nvram boot-args=no_compat_check' e depois prime enter.\n5. Reinicia o Mac e está pronto. ";
"PO-NV-BAR-TITLE" = "Problema com a NVRAM";
"PO-NV-BAR-SUBTITLE" = "Vamos resolver isto.";
"PO-NV-NOUP-TITLE" = "Não é Possível Atualizar sem o Valor de NVRAM Requerido";
"PO-NV-NOUP-CONTENT" = "A actualização do macOS remove o Patch do boot.plist, que é o que o Patched Sur utiliza para te permitir arrancar o Mac sem o -no_compat_check. Neste momento esse valor está em falta, pelo que a actualização faria com que o teu Mac já não arrancasse. Uma vez restabelecido esse valor, pode actualizar. Para o fazer, clica no botão vermelho na parte inferior da janela.";
